[
  {
    "position": "Junior Frontend Developer",
    "company": "iThink Logistics - E-commerce Courier Services",
    "duration": "July 2021 - July 2023",
    "location": "Onsite",
    "image": "/company/tentwenty.svg",
    "url": "https://www.tentwenty.me/",
    "responsibilities": [
      "My professional journey has seen notable achievements in software development and management. One such accomplishment is the development of a Vendor Dashboard, which consolidates essential vendor information onto a single, easily accessible page. Additionally, I've created multiple data tables to effectively display product records, thereby enhancing organizational efficiency. A special focus has been placed on customer relationship management, with the creation of a dedicated Customer Tracking Page. Furthermore, I led the development of an Issue Tracking and Communication Software, facilitating seamless collaboration between teams and vendors. The integration of dynamic modules underscores my adaptability to diverse user needs. In addition to development work, I've taken on the responsibility of mentoring interns, sharing my expertise and nurturing talent within the team. Coordinating usability testing reflects my commitment to user-centric solutions. Proficiency in HTML5, CSS3, and JavaScript has played a pivotal role in developing large-scale applications. In summary, my role reflects a comprehensive understanding of software development and management principles, demonstrating a commitment to excellence in every aspect of my work."
    ],
    "color": {
      "h": "221",
      "s": "79%",
      "l": "51%"
    }
  },
  {
    "position": "Web Developer",
    "company": "NYUCT Design Labs | Venture Design + Development",
    "duration": "August 2023 - Present",
    "location": "Onsite",
    "image": "/company/denge-bilgisayar.svg",
    "url": "httsp://denge.com.tr/",
    "responsibilities": [
      "In my current position as a web developer at NYUCT, I've focused my efforts on select projects, dedicating myself to the development and enhancement of a few key websites. Within this role, I've been deeply involved in every stage of the website development process, from conceptualization to deployment. By leveraging my skills and expertise, I've contributed to the creation of impactful and user-friendly websites that align with the objectives and vision of the organization. Additionally, I've provided valuable support and assistance to ventures associated with these websites, offering technical guidance and solutions to address their specific needs. My role has allowed me to channel my efforts effectively, ensuring that each website receives the attention and expertise required to achieve its goals. Through my work at NYUCT, I've been able to make meaningful contributions to the success of these select projects, further refining my skills as a web developer."
    ],
    "color": {
      "h": "206",
      "s": "59%",
      "l": "44%"
    }
  }
]
